{
  "categories": [
    {
      "id": 1,
      "nama": "Fiksi"
    },
    {
      "id": 2,
      "nama": "Non-Fiksi"
    },
    {
      "id": 3,
      "nama": "Komik"
    }
  ],
  "products": [
    {
      "id": 1,
      "kode": "F-01",
      "nama": "Dune: Bagian 1",
      "harga": 129000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/3/26/ih86gbr4urzmibs3ah49hq.jpg",
      "deskripsi": "Di planet Arrakis, kisah seorang pemuda bernama Paul Atreides bermula. Ayah Paul ditunjuk oleh Imperium sebagai penguasa di planet gurun tersebut yang juga dikenal dengan nama Dune itu. Meski bukan merupakan tempat yang nyaman untuk tinggal, Arrakis punya rempah berharga yang diperebutkan di seluruh jagat raya. Maka ketika Klan Atreides dikhianati, kehancuran keluarganya membuat Paul harus menempuh perjalanan menjemput takdir menuju padang pasir.",
      "penulis": "Frank Herbert",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 2,
      "kode": "F-02",
      "nama": "Sang Dewi Api (The Burning God)",
      "harga": 189000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/1/24/kuhe9qigbybry8wwmjavyn.jpg",
      "deskripsi": "Lanjutan Perang Opium dan Republik Naga Akhir luar biasa trilogi The Poppy War. Setelah berhasil menyelamatkan negara Nikan dalam perang saudara yang brutal, Fang Runin malah dikhianati para sekutu. Dengan aliansi baru, Rin menyusun kekuatan. Bagai terlahir kembali dari abu, sang Phoenix pun menemukan lagi kekuatan dalam kemurkaan dan pembalasan dendam rakyat selatan. Mereka menghabisi pihak Naga, orang-orang Hesperia, dan semua yang berusaha melenyapkan syamanisme. Namun, seiring meningkatnya kekuatan dan pengaruh Rin, apakah ia akan cukup kuat untuk melawan suara Phoenix yang mendesaknya membumihanguskan dunia?",
      "penulis": "R.F. Kuang",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 3,
      "kode": "F-03",
      "nama": "Bui",
      "harga": 145000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/2/3/uryfzjzmceunzqmzgy5d6f.jpg",
      "deskripsi": "DIANGKAT dari perjalanan hidup Tyo Pakusadewo, aktor Indonesia yang membintangi lebih dari 70 film, Bui menceritakan satu fragmen penting dalam liku-liku hidup seorang tokoh bernama Paku. Ia pecandu akut, ditangkap polisi setelah bertekad melepaskan diri dari jerat Narkoba. Kehidupan penjara serta proses peradilan yang mendahuluinya menjadi petualangan dan pertaruhan paling sengit dalam hidup Paku: manusia yang tak sanggup merumuskan makna hidupnya sendiri, apalah sebutannya? Bui sekaligus menampilkan refleksi mendalam tentang carut marut praktik peradilan di Indonesia, kaburnya batas adil dan zalim pelaksanaan hukum, serta mengungkap kejahatan besar dan terorganisir yang merajalela di tanah air namun tak pernah terlihat wujud utuhnya. Menjadi saksi bahwa kejahatan besar senantiasa melibatkan kekuasaan besar.",
      "penulis": "Alan Th",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 4,
      "kode": "F-04",
      "nama": "Teka Teki Rumah Aneh",
      "harga": 79000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/3/19/usxbcmoagfuidu4nsyv7tn.jpg",
      "deskripsi": "Seorang kenalan ingin membeli rumah seken di Tokyo dan memperlihatkan denah rumahnya padaku karena merasa ada yang ganjil. Sekilas, rumah ini kelihatan seperti rumah-rumah lain pada umumnya dengan interior yang luas dan terang. Namun, ketika mencermatinya baik-baik, aku mendapati bahwa memang ada keanehan di sana-sini. Keanehan demi keanehan itu bertumpuk, kemudian terjalin membentuk satu “kenyataan”. Kenyataan yang teramat sangat mengerikan, dan sama sekali tidak ingin kupercaya.",
      "penulis": "Uketsu",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 5,
      "kode": "F-05",
      "nama": "Orang Pertama Tunggal",
      "harga": 79000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/3/2/eg95ovvrmvw5jbkq3buxvp.jpg",
      "deskripsi": "Delapan kisah dalam buku ini diceritakan dari sudut pandang orang pertama tunggal khas narator klasik Murakami. Dari soal ingatan masa muda, renungan atas musik, dan kecintaan kuat pada bisbol, hingga skenario seperti mimpi dan album jazz yang direka cipta, kisah-kisah tersebut menantang batas-batas antara pikiran kita dan dunia luar. Kadang-kadang, sang narator tampak sebagai Murakami sendiri. Lantas apakah ini memoar atau fiksi? Pembaca dipersilakan untuk memutuskan sendiri. Filosofis dan misterius, kisah-kisah dalam Orang Pertama Tunggal menyentuh indahnya cinta dan kesendirian, masa kanak-kanak dan ingatan. . . semua dengan sentuhan khas Murakami.",
      "penulis": "Haruki Murakami",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 6,
      "kode": "F-06",
      "nama": "MetroPop: Hingga Ujung Cakrawala",
      "harga": 109000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/3/23/rvpnj5phwknsjxo9fdtcwy.jpg",
      "deskripsi": "Sepertinya masalah menjadi bagian tak terpisahkan dari hidup Anjani beberapa tahun terakhir. Ayahnya yang belum lama meninggal dunia ternyata memiliki anak laki-laki dari perempuan lain, dan harus tinggal dengan mereka. Ibunya menderita berbagai penyakit komplikasi yang nyaris menguras segala yang mereka miliki. Anjani tidak punya waktu untuk urusan asmara. Apalagi dengan seorang laki-laki yang berbeda kasta sosial dengannya. Itu sama saja mengundang masalah tambahan. Namun, bisakah Anjani menghindari laki-laki itu? Bisakah dia menolak cinta dari laki-laki yang terus mengejarnya hingga ujung cakrawala?",
      "penulis": "Titi Sanaria",
      "category": {
        "id": 1,
        "nama": "Fiksi"
      }
    },
    {
      "id": 7,
      "kode": "NF-01",
      "nama": "Grit: Kekuatan Passion dan Kegigihan",
      "harga": 128000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/1/10/4gax6nmcbrzespnl7ykp2u.jpg",
      "deskripsi": "Banyak orang yang mengira jika untuk mencapai sebuah kesuksesan, faktor yang paling berpengaruh adalah bakat alami, sehingga saat seseorang tidak mampu meraih kesuksesan, hal tersebut dirasa karena tidak mempunyai bakal alami di suatu bidang. Akibat stigma dan prasangka tersebut, banyak orang yang mulai merasa pesimistis ketika tidak mampu meraih tujuan yang mereka inginkan, sehingga perasaan rendah diri pun langsung menguasai karena sepertinya sudah tidak ada harapan lagi untuk memiliki bakat. Mengapa orang yang memiliki bakat alami selalu gagal mencapai potensi mereka, sementara orang lain yang tidak terlalu berbakat bisa menggapai hal-hal yang menakjubkan? Dalam buku yang harus dibaca oleh siapa saja yang ingin sukses ini, Angela Duckworth (seorang psikolog perintis) menunjukkan bahwa rahasia untuk pencapaian yang luar biasa bukanlah bakat, melainkan perpaduan istimewa antara hasrat (passion) dan kegigihan (perseverance) yang ia sebut (grit). Berdasarkan penelitian, wawancara dengan orang-orang yang berprestasi tinggi, serta pengalamannya sendiri, Duckworth menunjukkan bahwa kecenderungan kita untuk terpaku pada bakat alami itu salah: dari segi pencapaian, yang lebih penting adalah usaha yang kita lakukan dan reaksi kita terhadap hambatan. Kemudian, ia menjelaskan bahwa ketabahan bisa dipelajari sekaligus menawarkan rumusan baru kesuksesan individu maupun kesuksesan kolektif.",
      "penulis": "Angela Duckworth",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 8,
      "kode": "NF-02",
      "nama": "Rich Dad The Business of the 21st Century (Ed. Revisi)",
      "harga": 68000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/items/9786020367835_rich-dad-the-business-of-the-21st-century-_ed.-revisi_.jpg",
      "deskripsi": "Anda geram dengan korupsi di dunia bisnis? Pada Wall Street dan bank-bank yang membiarkan praktik seperti itu terjadi? Pada pemerintah yang terlalu lamban, atau terlalu reaktif, atau terlalu sering bertindak salah dan terlalu sedikit bertindak benar?",
      "penulis": "Robert T. Kiyosaki",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 9,
      "kode": "NF-03",
      "nama": "Bahagia Beragama Bersama Gus Baha",
      "harga": 85000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/items/9786230034763_COVER_BAHAGIA_BERSAMA_GUS_BAHA.jpg",
      "deskripsi": "Gus Baha adalah oase di tengah merebaknya penceramah agama –atau orang-orang yang berharap dianggap demikian—yang lebih senang menampilkan agama sebagai sesuatu yang kaku dan bahkan cenderung wagu. Mereka kerap menampilkan wajah Tuhan sebagai sosok yang kejam dan penuh ancaman, padahal Tuhan adalah Maha Pengasih lagi Maha Penyayang. Dengan penampilan dan model penyampaian yang sederhana, Gus Baha mengembalikan marwah agama yang sebenarnya, bahwa agama adalah sumber kebahagiaan. Bersama Gus Baha, agama terasa sangat mudah untuk dipahami dan diamalkan. Dan semoga dengan itu, ada banyak manfaat dan kebaikan yang bisa kita tinggalkan.",
      "penulis": "Khoirul Anam",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 10,
      "kode": "NF-04",
      "nama": "Mengelola Kredit Secara Sehat - Cover Baru",
      "harga": 162000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/items/9786020309859_Mengelola-Kredit-Secara-Sehat-cover-baru.jpg",
      "deskripsi": "Buku ini membahas berbagai informasi, dari organisasi perkreditan, budaya kredit, produk kredit, risiko perkreditan, proses kredit, penetapan suku bunga kredit, hukum perkreditan, pemasaran sampai pembiayaan syariah.",
      "penulis": "Ikatan Bankir Indonesia",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 11,
      "kode": "NF-05",
      "nama": "Seni Menjadi Orang Tua Hebat",
      "harga": 69000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/items/COVER_SENI_MENJADI_ORANG_TUA_HEBAT_FIX_MEI_2022_page-0001.jpg",
      "deskripsi": "Buku aturan emas tentang praktik-praktik terbaik dari parenting, Seni Menjadi Orang Tua Hebat ini dengan tepat menghadirkan cara-cara kunci untuk membantu para orang tua membentuk kembali tingkah laku anak-anaknya yang menantang, menciptakan ikatan keluarga yang kuat, serta membimbing anak-anak untuk menjadi orang dewasa yang bahagia, baik hati, dan bertanggung jawab. Seni Menjadi Orang Tua Hebat merupakan peta jalan dari segala sesuatu yang anda perlukan untuk melakukan parenting sehingga Anda akan berulang kali menggunakannya.",
      "penulis": "Erica Reishcer",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 12,
      "kode": "NF-06",
      "nama": "Kecerdasan Emosional",
      "harga": 115000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/items/img20220831_12081251.jpg",
      "deskripsi": "Apakah IQ adalah takdir? Ternyata tidak sebagaimana yang lumrah kita pikirkan. Gardner memperlihatkan mengapa orang yang ber-IQ tinggi mengalami kegagalan dan orang yang ber-IQ sedang menjadi sangat sukses. Penyebabnya adalah “kecerdasan emosional”, yang mencakup kesadaran diri dan kendali dorongan hati, ketekunan, semangat dan motivasi diri, empati, serta kecakapan sosial.",
      "penulis": "Daniel Goleman",
      "category": {
        "id": 2,
        "nama": "Non-Fiksi"
      }
    },
    {
      "id": 13,
      "kode": "K-01",
      "nama": "One Piece 102",
      "harga": 45000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/4/5/nlevqbzsajydmjgz3se8qr.jpg",
      "deskripsi": "Luffy yang kembali bangkit, menghadapi Kaido sekali lagi! Ke mana arah pertempuran dua tokoh besar yang sudah menjelang babak penghabisan ini!? Sementara itu, waktu penentuan telah tiba bagi kawan-kawannya yang sedang melakukan pertempuran sengit melawan para petinggi di setiap tempat. Simak kisah petualangan di lautan, One Piece!!",
      "penulis": "Eiichiro Oda",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    },
    {
      "id": 14,
      "kode": "K-02",
      "nama": "Jujutsu Kaisen 09",
      "harga": 40000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/4/5/4iswivvpqmanr9jicajws5.jpg",
      "deskripsi": "Jujutsu Kaisen adalah serial manga Jepang yang ditulis dan diilustrasikan oleh Gege Akutami. Ini telah diserialkan di majalah manga shōnen Shueisha Weekly Shonen Jump sejak Maret 2018, dengan bab-babnya dikumpulkan dan diterbitkan dalam 20 volume tankōbon per Agustus 2022. Ceritanya mengikuti siswa sekolah menengah Yuji Itadori saat ia bergabung dengan organisasi rahasia Penyihir Jujutsu untuk menghilangkan Kutukan yang kuat bernama Ryomen Sukuna, di mana Yuji menjadi inangnya. Jujutsu Kaisen adalah sekuel dari Sekolah Teknik Kutukan Metropolitan Tokyo Akutami, yang diserialkan di Jump GIGA Shueisha dari April hingga Juli 2017, kemudian dikumpulkan dalam volume tankōbon, dengan judul retroaktif sebagai Jujutsu Kaisen 0, pada Desember 2018.",
      "penulis": "Gege Akutami",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    },
    {
      "id": 15,
      "kode": "K-03",
      "nama": "AKASHA : Chainsaw Man 02",
      "harga": 48000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/3/30/ptiw9zxqqeu4txkvcxab7j.png",
      "deskripsi": "Denji, pemuda super miskin yang dikejar banyak utang, bekerja sebagai devil hunter bersama iblis bernama Pochita. Hari-harinya sebagai manusia kasta terbawah berubah total setelah sebuah pengkhianatan brutal. Meski Denji menyimpan iblis dalam tubuhnya setelah insiden tersebut, dia tetap harus memburu iblis agar bisa bertahan hidup!?",
      "penulis": "Tatsuki Fujimoto",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    },
    {
      "id": 16,
      "kode": "K-04",
      "nama": "Blue Lock 07",
      "harga": 45000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/2/1/owgscp4tnyetyimchyxccs.jpg",
      "deskripsi": "Kehilangan Bachira setelah kalah oleh striker papan atas, Rin Itoshi, dan kelompoknya dalam Rivalry Battle seleksi tahap 2 di mana pemenang mengambil pemain yang kalah, Isagi dan Nagi bersumpah untuk bangkit kembali dan berkembang, lalu melanjutkan ke pertandingan berikutnya. Pada pertarungan 2 vs 2 di mana kekuatan individu yang terbatas diuji, lawan yang dihadapi ternyata pencetak gol terbanyak blok 5, Barou. Kalau kalah, akan jatuh ke jurang eliminasi. Target Isagi, mencapai sisi jenius yang ada setelah mengalahkan king Barou!",
      "penulis": "Muneyuki Kaneshiro",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    },
    {
      "id": 17,
      "kode": "K-05",
      "nama": "Spy x Family 08",
      "harga": 45000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/1/5/4yptrpz6kccjmbrxkvojp8.jpg",
      "deskripsi": "Di atas kapal pesiar mewah, berkumpul lah para pembunuh bayaran yang mengincar istri mendiang bos mafia. Meski suami dan anaknya pun ikut, Yor tak bisa bersenang-senang sama sekali. Yor pun mulai bertanya, untuk apa dia masih meneruskan pekerjaan berbahaya ini.",
      "penulis": "Endo Tatsuya",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    },
    {
      "id": 18,
      "kode": "K-06",
      "nama": "Dragon Ball Super Vol. 16",
      "harga": 40000,
      "is_ready": true,
      "gambar": "https://cdn.gramedia.com/uploads/picture_meta/2023/2/22/mxaruqgqbgrb7hbzs82cht.jpg",
      "deskripsi": "Granolah adalah penyintas dari ras Cerealian yang dulu dibinasakan oleh pasukan Frieza dan Saiyan. Dia menggunakan dragon ball planet Cereal untuk menjadikan dirinya petarung terkuat se-universe, lalu mulai beraksi untuk membalas dendam. Di sisi lain, Goku dan Vegeta mendapatkan permintaan kerja dari Heeter untuk membasmi Granolah!?",
      "penulis": "Akira Toriyama",
      "category": {
        "id": 3,
        "nama": "Komik"
      }
    }
  ],
  "carts": [],
  "orders": []
}
